driver-tests/bpelse/assign/AssignSelectionFailureJBI/test/SelectionFailure_ToSpec_Invalid_Element/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:mes="http://xml.netbeans.org/schema/MessageType">
  <soapenv:Body>
    <mes:xsdMessage>
      <mes:Element1>3</mes:Element1>
      <mes:Element2>Test_Element3</mes:Element2>
    </mes:xsdMessage>
  </soapenv:Body>
</soapenv:Envelope>