driver-tests/bpelse/assign/AssignSelectionFailureJBI/test/SelectionFailure_FromSpec_InValid_NamespacePrefix/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:xsdMessage xmlns:msgns="http://j2ee.netbeans.org/wsdl/Assign_NoElement" xmlns:ns1="http://xml.netbeans.org/schema/MessageType">
      <ns1:Element1>4</ns1:Element1>
      <ns1:Element2>1. Input is 4 and Test_Element4 \n 2. Caught SelectionFailure in FromSpec. Namespace Prefix MyOwnNamespace is invalid . Output sent from FH </ns1:Element2>
    </ns1:xsdMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
