driver-tests/bpelse/assign/AssignSelectionFailureJBI/test/results/SelectionFailure_ToSpec_Invalid_NamespacePrefix/Actual_20130222125550_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <xsdMessage xmlns="http://xml.netbeans.org/schema/MessageType" xmlns:msgns="http://j2ee.netbeans.org/wsdl/Assign_NoElement">
      <Element1>2</Element1>
      <Element2>Reply from Catch All. This should not have executed. </Element2>
    </xsdMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>